mdhardenburgh/Blinky/Packages/.cache/Keil.LPC1800_DFP.2.10.0.pdsc
        <!-- *************************  Device 'LPC1850'  ***************************** -->
        <device Dname="LPC1850">
          <compile header="Device/Include/LPC18xx.h"  define="LPC18xx"/>
          <debug      svd="SVD/LPC18xx.svd"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x18000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="0"/>
          <book       name="Documents/UM10430.pdf"                          title="LPC1800 Series Reference Manual"/>
          <book       name="Documents/LPC1850_30_20_10.pdf"                 title="LPC1800 Series Datasheet"/>
          <book       name="Documents/ES_LPC18X0.pdf"                       title="LPC1800 Series Erratasheet"/>
          <book       name="Documents/mcb1800.chm"                          title="MCB1800 User's Guide"/>
        </device>

        <!-- *************************  Device 'LPC1853'  ***************************** -->
        <device Dname="LPC1853">
          <compile header="Device/Include/LPC18xx.h"  define="LPC18xx"/>
          <debug      svd="SVD/LPC18xx.svd"/>
          <memory     id="IROM1"                      start="0x1A000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x1B000000"  size="0x40000"    startup="0"   default="0"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="Flash/LPC18xx43xx_256_BA.FLM" start="0x1A000000" size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm  name="Flash/LPC18xx43xx_256_BB.FLM" start="0x1B000000" size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book       name="Documents/UM10430.pdf"                          title="LPC1800 Series Reference Manual"/>
          <book       name="Documents/LPC1850_30_20_10.pdf"                 title="LPC1800 Series Datasheet"/>
          <book       name="Documents/ES_LPC18X0.pdf"                       title="LPC1800 Series Erratasheet"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>
        </device>

        <!-- *************************  Device 'LPC1857'  ***************************** -->
        <device Dname="LPC1857">
          <compile header="Device/Include/LPC18xx.h"  define="LPC18xx"/>
          <debug      svd="SVD/LPC18xx.svd"/>
          <memory     id="IROM1"                      start="0x1A000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x1B000000"  size="0x80000"    startup="0"   default="0"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm  name="Flash/LPC18xx43xx_512_BB.FLM" start="0x1B000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book       name="Documents/UM10430.pdf"                          title="LPC1800 Series Reference Manual"/>
          <book       name="Documents/LPC1850_30_20_10.pdf"                 title="LPC1800 Series Datasheet"/>
          <book       name="Documents/ES_LPC18X0.pdf"                       title="LPC1800 Series Erratasheet"/>
          <book       name="Documents/mcb1800.chm"                          title="MCB1800 User's Guide"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC18S1x'  **************************** -->
      <subFamily DsubFamily="LPC18S1x">
        <feature type="Crypto"        n="128"                      name="AES engine for encryption and decryption"/>

        <!-- *************************  Device 'LPC18S10'  ***************************** -->
        <device Dname="LPC18S10">
          <compile header="Device/Include/LPC18xx.h"  define="LPC18xx"/>
          <debug svd="SVD/LPC18xx.svd"/>
          <memory id="IRAM1"                             start="0x10000000" size="0x10000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                             start="0x20000000" size="0x4000"     init   ="0"   default="0"/>

          <book name="Documents/UM10430.pdf"        title="LPC18xx Reference Manual"/>
          <book name="Documents/LPC18S50_30_10.pdf" title="LPC18S50/S30/S10 Datasheet"/>

          <feature type="PWM"           n="6"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC18S3x'  **************************** -->
      <subFamily DsubFamily="LPC18S3x">
        <feature type="PWM"           n="6"/>
        <feature type="ETH"      n="1"       m="100000000"/>
        <feature type="USBD"          n="2"/>
        <feature type="Crypto"        n="128"                      name="AES engine for encryption and decryption"/>

        <!-- *************************  Device 'LPC18S30'  ***************************** -->
        <device Dname="LPC18S30">
          <compile header="Device/Include/LPC18xx.h"  define="LPC18xx"/>
          <debug svd="SVD/LPC18xx.svd"/>
          <memory id="IRAM1"                             start="0x10000000" size="0x18000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                             start="0x20000000" size="0x10000"    init   ="0"   default="0"/>

          <book name="Documents/UM10430.pdf"        title="LPC18xx Reference Manual"/>
          <book name="Documents/LPC18S50_30_10.pdf" title="LPC18S50/S30/S10 Datasheet"/>
        </device>

